IDEA Open Model
PlateData Class
 Provides data of the single plate
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.Connection.PlateData
 Namespace: IdeaRS.OpenModel.Connection
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 10.0.1.1 (10.0.1.1)
Syntax
public class PlateData
Public Class PlateData
public ref class PlateData
The PlateData type exposes the following members.
Constructors
Name | Description
PlateData
Initializes a new instance of the PlateData class
Top
Properties
Name | Description
AxisX
 LCS - Axis X
AxisY
 LCS - Axis Y
AxisZ
 LCS - Axis Z
Id
 Plate unique ID
Material
 Name of the material
Name
 Name of the plate
Origin
 Origin of the plate LCS
OriginalModelId
 Get or set the identification in the original model In the case of the imported connection from another application
OutlinePoints
 Outline points
Region
 Geometry of the plate in svg format
Thickness
 Thickness of the plate
Top
See Also
Reference
IdeaRS.OpenModel.Connection Namespace